{
  "uk": {
    "host-assistant": {
      "buttons-not-for-you": "Ці кнопки не для вас.",
      "start-question": "Ви хочете запустити Помічника Ведучого?",
      "start-btn": "Так",
      "cancel-btn": "Ні",
      "mafia-group-desc": "Ведучий знайомиться із мафією",
      "mafia-with-don-group-desc": "Ведучий знайомиться із мафією. Дон показує себе",
      "maniac-desc": "Ведучий знайомиться з маніяком",
      "commissar-desc": "Ведучий знайомиться з комісаром",
      "doctor-desc": "Ведучий знайомиться з лікарем",
      "city-wake-up-desc": "Місто прокидається для початку гри.",
      "no-roles": "Немає ролей для знайомства у цю ніч.",
      "btn-stop": "Достроково завершити гру",
      "btn-back": "Назад",
      "btn-next": "Далі",
      "btn-pause": "Пауза",
      "btn-resume": "Продовжити",
      "speaking": "Говорить [{{number}}] {{player}}. Залишилось: **{{time}}**",
      "justification": "Виправдальна промова [{{number}}] {{player}}. Залишилось: **{{time}}**",
      "night-mafia": "Мафія, оберіть, кого вбити",
      "night-don": "Дон, оберіть гравця для перевірки",
      "night-maniac": "Маніяк, оберіть, кого вбити",
      "night-commissar": "Комісар, оберіть, кого перевірити",
      "night-doctor": "Лікар, оберіть, кого вилікувати",
      "night-don-result": "{{player}} — {{role}}",
      "night-commissar-result": "{{player}} — {{role}}",
      "game-stopped": "Гру достроково завершено.",
      "finished": "Ведучий познайомився з усіма ролями.",
      "timeout": "Час вийшов. Знайомство завершено примусово."
    },
    "roles": {
      "mafia": "Мафія",
      "mafia-description": "Ти — **Мафія**. Вночі разом із іншими мафіозі обираєш жертву для вбивства. Твоя мета — ліквідувати всіх мирних жителів і залишитись непоміченим. Працюй у тіні, щоб контролювати гру, уникай підозр і маніпулюй голосуваннями вдень.",
      "don": "Дон",
      "don-description": "Ти — **Дон**, лідер мафії. Крім звичайних дій Мафії, ти можеш вночі перевіряти інших гравців на роль комісара, щоб убезпечити свою команду від розкриття. Твоя стратегія має бути витонченою: використай свої можливості для усунення загроз і приведи Мафію до перемоги.",
      "citizen": "Мирний житель",
      "citizen-description": "Ти — **Мирний житель**. Не маючи спеціальних здібностей, твоя головна мета — вижити та виявити мафію. Спостерігай за поведінкою інших гравців, аналізуй голосування і прислухайся до підказок, щоб допомогти команді мирних здобути перемогу.",
      "commissar": "Комісар",
      "commissar-description": "Ти — **Комісар**. Кожної ночі ти можеш перевіряти одного гравця, щоб дізнатись, чи він є мафією. Використовуй цю інформацію мудро, повідомляй іншим мирним, але будь обережним, щоб тебе не викрили, інакше тебе можуть вбити наступної ночі.",
      "doctor": "Лікар",
      "doctor-description": "Ти — **Лікар**. Вночі ти можеш врятувати одного гравця від вбивства мафіозі. Обирай, кого захищати, враховуючи підозри і ризики. Твої рішення можуть змінити хід гри, зберігаючи життя важливих для мирної команди гравців.",
      "maniac": "Маніяк",
      "maniac-description": "Ти — **Маніяк**. Твоя ціль — вбити всіх інших гравців, незалежно від їх ролей. Ти дієш самостійно і не маєш союзників. Обережно балансуй між нападом і приховуванням, щоб залишитись останнім живим та виграти гру."
    },
    "mafia_rules": {
      "title": "🎭 Правила Мафії",
      "roles": {
        "title": "🎲 Ролі",
        "mafia": "{{emoji}} **Мафія** — жестами вночі домовляється, кого вбити.",
        "don": "{{emoji}} **Дон** — лідер мафії, також перевіряє гравців на роль Комісара.",
        "commissar": "{{emoji}} **Комісар** — перевіряє 1 гравця за ніч (не вбиває). Дізнається, чи гравець є Мафією.",
        "doctor": "{{emoji}} **Лікар** — лікує 1 гравця за ніч, але не 2 рази підряд.",
        "citizen": "{{emoji}} **Мирні жителі** — шукають мафію через обговорення.",
        "maniac": "{{emoji}} **Маніяк** — грає сам за себе, щоночі може вбити одного гравця."
      },
      "cameras": {
        "title": "📹 Камери",
        "rules": ["Всі гравці мають бути з увімкненими камерами.", "Вибув — вимикаєш камеру."]
      },
      "zero_round": {
        "title": "🕊 Нульове коло",
        "rules": [
          "Знайомство, без голосування.",
          "Після нього мафія вночі вбиває одну людину.",
          "🛡 Гравець, якого першим вбили в попередній грі, має імунітет — його не можна вбивати першим у цій грі."
        ]
      },
      "game_flow": {
        "title": "🔄 Хід гри",
        "day": [
          "Перший гравець зобов'язаний висунути когось на голосування.",
          "Інші гравці можуть підтримати або висунути інших.",
          "Перед голосувавнням кожен висунутий має право на 30-секунду виправдальну промову",
          "Голосування проводиться між усіма висунутими.",
          "Той, хто набирає найбільше голосів, буде повішеним.",
          "Вибулий має 30 сек. на фінальну промову (лише вдень).",
          "Гравці не можуть говорити під час голосування, окрім ведучого."
        ],
        "night": [
          "Прокидається мафія і жестами обирає жертву.",
          "Дон перевіряє одного гравця на роль Комісара.",
          "Комісар перевіряє одного гравця на наявність серед мафії (Дон вважається мафією).",
          "Лікар обирає одного гравця для лікування (не можна лікувати одного й того ж гравця двічі підряд).",
          "Маніяк обирає одного гравця, якого вбиває."
        ]
      }
    },
    "vampire": {
      "roles": {
        "dracula": "Дракула",
        "dracula-description": "Ти — **Дракула**. Щоночі ти можеш вкусити одного гравця, щоб перетворити його на вампіра. Темна команда перемагає, якщо кількість вампірів дорівнює або перевищує кількість світлих.",
        "vanHelsing": "Ван Гелсінг",
        "vanHelsing-description": "Ти — **Ван Гелсінг**. Щоночі ти називаєш одного гравця: якщо це вампір — він помирає. Ця властивість не діє на Дракулу. Один раз можеш пережити укус Дракули без перетворення, але втрачаєш здатність убивати вампірів.",
        "tomSawyer": "Том Сойєр",
        "tomSawyer-description": "Ти — **Том Сойєр**. Сироватка на тебе не діє. Маєш базову силу дуелі +1, і з кожною дуеллю сила зростає ще на +1.",
        "phoenix": "Фенікс",
        "phoenix-description": "Ти — **Фенікс**. Якщо тебе кусає Дракула, ти помираєш на один день і ніч, а потім воскресаєш і граєш далі за світлих. Наступні укуси повторюють цей ефект. Вбивці вбивають тебе назавжди.",
        "golem": "Голем",
        "golem-description": "Ти — **Голем**. Не перетворюєшся, якщо тебе кусає Дракула. Після цього Дракула наступної ночі не може нікого вкусити (зуби болять!).",
        "ghost": "Привид",
        "ghost-description": "Ти — **Привид**. Якщо тебе кусає Дракула, ти стаєш безсмертним до кінця гри, але не можеш більше говорити. Якщо скажеш хоч слово — помираєш одразу.",
        "invisible": "Невидимка",
        "invisible-description": "Ти — **Невидимка**. Один раз за гру переживаєш сироватку незалежно від команди. Усі перевірки від інших гравців не працюють.",
        "witch": "Відьма",
        "witch-description": "Ти — **Відьма**. Граєш за світлих, але якщо тебе вкусить Дракула, результат наступного голосування скасовується.",
        "citizen": "Мирний житель",
        "citizen-description": "Ти — **Мирний житель**. Не маєш спеціальних здібностей, твоя мета — вижити та допомогти світлим перемогти вампірів."
      }
    }
  },
  "en": {
    "host-assistant": {
      "buttons-not-for-you": "These buttons are not for you.",
      "start-question": "Do you want to start Host Assistant?",
      "start-yes": "Yes",
      "start-no": "No",
      "mafia-group-desc": "Host meets the mafia",
      "mafia-with-don-group-desc": "Host meets the mafia. Don shows himself",
      "maniac-desc": "Host meets the maniac",
      "commissar-desc": "Host meets the commissar",
      "doctor-desc": "Host meets the doctor",
      "city-wake-up-desc": "The city wakes up for the start of the game.",
      "no-roles": "No roles to meet tonight.",
      "btn-stop": "Stop game early",
      "btn-back": "Back",
      "btn-next": "Next",
      "btn-pause": "Pause",
      "btn-resume": "Resume",
      "speaking": "Speaking [{{number}}] {{player}}. Left: **{{time}}**",
      "night-mafia": "Mafia, choose who to kill",
      "night-don": "Don, choose a player to check",
      "night-maniac": "Maniac, choose who to kill",
      "night-commissar": "Commissar, choose a player to check",
      "night-doctor": "Doctor, choose someone to heal",
      "night-don-result": "{{player}} — {{role}}",
      "night-commissar-result": "{{player}} — {{role}}",
      "game-stopped": "Game stopped early.",
      "finished": "Host has met all roles.",
      "timeout": "Time's up. Introduction ended forcibly."
    },
    "roles": {
      "mafia": "Mafia",
      "mafia-description": "You are **Mafia**. At night, you collaborate with other mafia members to choose a target to eliminate. Your goal is to secretly remove all the citizens while avoiding suspicion. Work in the shadows, manipulate voting during the day, and keep your identity hidden to secure a win for your team.",
      "don": "Don",
      "don-description": "You are the **Don**, the leader of the mafia. Besides the regular mafia actions, you have the special ability to check if a player is the commissioner during the night. Use this power strategically to protect your team from being exposed and to eliminate threats. Lead the mafia wisely to victory.",
      "citizen": "Citizen",
      "citizen-description": "You are a **Citizen**. Without any special abilities, your primary goal is to survive and identify the mafia members. Pay attention to player behavior, analyze votes, and collaborate with other citizens to uncover the mafia and win the game.",
      "commissar": "Commissioner",
      "commissar-description": "You are the **Commissioner**. Each night, you can investigate one player to learn whether they belong to the mafia. Use this information carefully to inform the citizens, but be cautious to avoid revealing yourself, as the mafia may target you next.",
      "doctor": "Doctor",
      "doctor-description": "You are the **Doctor**. Each night, you have the ability to save one player from being killed by the mafia. Choose wisely whom to protect, considering suspicions and threats. Your decisions can change the course of the game by preserving key citizens.",
      "maniac": "Maniac",
      "maniac-description": "You are the **Maniac**. Your goal is to kill all other players, regardless of their roles. You work alone with no allies. Balance your attacks and concealment carefully to be the last player alive and claim victory."
    },
    "mafia_rules": {
      "title": "🎭 Mafia Rules",
      "roles": {
        "title": "🎲 Roles",
        "mafia": "{{emoji}} **Mafia** — communicates at night using gestures to agree on a target to kill.",
        "don": "{{emoji}} **Don** — the Mafia leader, also checks players for the role of Commissar.",
        "commissar": "{{emoji}} **Commissar** — checks 1 player per night (doesn't kill). Learns if the player is Mafia.",
        "doctor": "{{emoji}} **Doctor** — heals 1 player per night, but can't heal 2 players in a row.",
        "citizen": "{{emoji}} **Civilians** — search for the Mafia through discussion.",
        "maniac": "{{emoji}} **Maniac** — plays solo and can kill one player each night."
      },
      "cameras": {
        "title": "📹 Cameras",
        "rules": [
          "All players must have their cameras turned on.",
          "Eliminated players must turn their cameras off."
        ]
      },
      "zero_round": {
        "title": "🕊 Zero Round",
        "rules": [
          "Introductions only, no voting.",
          "After this, the Mafia kills one person during the night.",
          "🛡 The player who was killed first in the previous game has immunity — they cannot be killed first this game."
        ]
      },
      "game_flow": {
        "title": "🔄 Game Flow",
        "day": [
          "The first player must nominate someone for voting.",
          "Other players may support or nominate additional candidates.",
          "Each nominated player gets a 30-second defense speech before voting.",
          "Voting is conducted among all nominated players.",
          "The player with the most votes will be hanged.",
          "The eliminated player gets a 30-second final speech (daytime only).",
          "Players may not speak during voting, except the host."
        ],
        "night": [
          "The Mafia wakes up and silently chooses a victim.",
          "The Don checks one player to identify the Commissar.",
          "The Commissar checks one player to see if they are part of the Mafia (Don counts as Mafia).",
          "The Doctor selects one player to heal (cannot heal the same player two nights in a row).",
          "The Maniac selects one player to kill."
        ]
      }
    },
    "vampire": {
      "roles": {
        "dracula": "Dracula",
        "dracula-description": "You are **Dracula**. Each night you may bite one player to turn them into a vampire. The dark team wins if the number of vampires equals or exceeds the number of light players.",
        "vanHelsing": "Van Helsing",
        "vanHelsing-description": "You are **Van Helsing**. Each night you name one player: if they are a vampire — they die. This ability does not affect Dracula. Once, you can survive Dracula's bite without turning but you lose your ability to kill vampires.",
        "tomSawyer": "Tom Sawyer",
        "tomSawyer-description": "You are **Tom Sawyer**. The serum does not affect you. You have base duel power +1, and with each duel your power increases by +1.",
        "phoenix": "Phoenix",
        "phoenix-description": "You are **Phoenix**. If Dracula bites you, you die for one day and night and then resurrect to continue playing for the light team. Subsequent bites repeat this effect. Killers kill you permanently.",
        "golem": "Golem",
        "golem-description": "You are **Golem**. You do not turn if bitten by Dracula. After this, Dracula cannot bite anyone the following night (his teeth hurt!).",
        "ghost": "Ghost",
        "ghost-description": "You are **Ghost**. If Dracula bites you, you become immortal until the end of the game but you can no longer speak. If you say even one word — you die instantly.",
        "invisible": "Invisible",
        "invisible-description": "You are **Invisible**. Once per game you survive the serum regardless of team. All checks from other players do not work on you.",
        "witch": "Witch",
        "witch-description": "You are **Witch**. You play for the light team, but if Dracula bites you, the result of the next vote is cancelled.",
        "citizen": "Citizen",
        "citizen-description": "You are **Citizen**. You have no special abilities; your goal is to survive and help the light team defeat the vampires."
      }
    }
  }
}
