{
  "uk": {
    "roles": {
      "mafia": "Мафія",
      "mafia-description": "Ти — **Мафія**. Вночі разом із іншими мафіозі обираєш жертву для вбивства. Твоя мета — ліквідувати всіх мирних жителів і залишитись непоміченим. Працюй у тіні, щоб контролювати гру, уникай підозр і маніпулюй голосуваннями вдень.",
      "don": "Дон",
      "don-description": "Ти — **Дон**, лідер мафії. Крім звичайних дій Мафії, ти можеш вночі перевіряти інших гравців на роль комісара, щоб убезпечити свою команду від розкриття. Твоя стратегія має бути витонченою: використай свої можливості для усунення загроз і приведи Мафію до перемоги.",
      "citizen": "Мирний житель",
      "citizen-description": "Ти — **Мирний житель**. Не маючи спеціальних здібностей, твоя головна мета — вижити та виявити мафію. Спостерігай за поведінкою інших гравців, аналізуй голосування і прислухайся до підказок, щоб допомогти команді мирних здобути перемогу.",
      "commissar": "Комісар",
      "commissar-description": "Ти — **Комісар**. Кожної ночі ти можеш перевіряти одного гравця, щоб дізнатись, чи він є мафією. Використовуй цю інформацію мудро, повідомляй іншим мирним, але будь обережним, щоб тебе не викрили, інакше тебе можуть вбити наступної ночі.",
      "doctor": "Лікар",
      "doctor-description": "Ти — **Лікар**. Вночі ти можеш врятувати одного гравця від вбивства мафіозі. Обирай, кого захищати, враховуючи підозри і ризики. Твої рішення можуть змінити хід гри, зберігаючи життя важливих для мирної команди гравців.",
      "maniac": "Маніяк",
      "maniac-description": "Ти — **Маніяк**. Твоя ціль — вбити всіх інших гравців, незалежно від їх ролей. Ти дієш самостійно і не маєш союзників. Обережно балансуй між нападом і приховуванням, щоб залишитись останнім живим та виграти гру."
    },
    "mafia_rules": {
      "title": "🎭 Правила Мафії — Офіс Нотевського",
      "roles": {
        "title": "🎲 Ролі",
        "mafia": "{{emoji}} Мафія — жестами вночі домовляється, кого вбити.",
        "commissar": "{{emoji}} Комісар — перевіряє 1 гравця за ніч (не вбиває). Дізнається чи гравець є Мафією або Доном.",
        "doctor": "{{emoji}} Лікар — лікує 1 гравця за ніч, 2 рази підряд того самого — заборонено.",
        "civilians": "{{emoji}} Мирні жителі — шукають мафію через обговорення."
      },
      "cameras": {
        "title": "📹 Камери",
        "rules": ["Всі гравці мають бути з увімкненими камерами.", "Вибув — вимикаєш камеру."]
      },
      "zero_round": {
        "title": "🕊 Нульове коло",
        "rules": ["Знайомство, без голосування.", "Після нього мафія вночі вбиває одну людину."]
      },
      "game_flow": {
        "title": "🔄 Хід гри",
        "night": ["Мафія", "Комісар", "Лікар"],
        "day": [
          "Перший гравець зобов'язаний висунути когось на голосування.",
          "Той, хто набирає найбільше голосів будеш повішеним.",
          "Вибулий має 30 сек. на фінальну промову (лише вдень)."
        ]
      }
    }
  },
  "en": {
    "roles": {
      "mafia": "Mafia",
      "mafia-description": "You are **Mafia**. At night, you collaborate with other mafia members to choose a target to eliminate. Your goal is to secretly remove all the citizens while avoiding suspicion. Work in the shadows, manipulate voting during the day, and keep your identity hidden to secure a win for your team.",
      "don": "Don",
      "don-description": "You are the **Don**, the leader of the mafia. Besides the regular mafia actions, you have the special ability to check if a player is the commissioner during the night. Use this power strategically to protect your team from being exposed and to eliminate threats. Lead the mafia wisely to victory.",
      "citizen": "Citizen",
      "citizen-description": "You are a **Citizen**. Without any special abilities, your primary goal is to survive and identify the mafia members. Pay attention to player behavior, analyze votes, and collaborate with other citizens to uncover the mafia and win the game.",
      "commissar": "Commissioner",
      "commissar-description": "You are the **Commissioner**. Each night, you can investigate one player to learn whether they belong to the mafia. Use this information carefully to inform the citizens, but be cautious to avoid revealing yourself, as the mafia may target you next.",
      "doctor": "Doctor",
      "doctor-description": "You are the **Doctor**. Each night, you have the ability to save one player from being killed by the mafia. Choose wisely whom to protect, considering suspicions and threats. Your decisions can change the course of the game by preserving key citizens.",
      "maniac": "Maniac",
      "maniac-description": "You are the **Maniac**. Your goal is to kill all other players, regardless of their roles. You work alone with no allies. Balance your attacks and concealment carefully to be the last player alive and claim victory."
    },
    "mafia_rules": {
      "title": "🎭 Mafia Rules — Notevskyi Office",
      "roles": {
        "title": "🎲 Roles",
        "mafia": "{{emoji}} Mafia — silently agrees using gestures at night on who to eliminate.",
        "commissar": "{{emoji}} Commissar — checks 1 player per night (does not kill). Learns whether the player is Mafia or Don.",
        "doctor": "{{emoji}} Doctor — heals 1 player per night; healing the same player two nights in a row is not allowed.",
        "civilians": "{{emoji}} Civilians — try to find mafia through discussion."
      },
      "cameras": {
        "title": "📹 Cameras",
        "rules": [
          "All players must keep their cameras on during the game.",
          "Eliminated players must turn off their camera."
        ]
      },
      "zero_round": {
        "title": "🕊 Zero Round",
        "rules": [
          "Introductory round, no voting.",
          "After it ends, mafia kills one player during the first night."
        ]
      },
      "game_flow": {
        "title": "🔄 Game Flow",
        "night": ["Mafia", "Commissar", "Doctor"],
        "day": [
          "The first player must nominate someone for voting.",
          "The player with the most votes is eliminated.",
          "Eliminated player has 30 seconds for a final speech (day only)."
        ]
      }
    }
  }
}
